БухЭксп/Catalogs/CW_ШаблоныСтандартныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ШаблоныСтандартныхПисем</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытаяКопия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеФайла</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ШаблоныСтандартныхПисем/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ОбъектШаблона) Тогда
		ЗаполнитьДеревоМакросов();                       
	КонецЕсли;
	
	ПоказатьСкрытьМакросыНаСервере();
	
	Если ЗначениеЗаполнено(Объект.ТелоHTML) Тогда
		СтруктураВложений = Новый Структура;
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Для Каждого СтрокаВложений из Параметры.ЗначениеКопирования.Вложения Цикл
				СтруктураВложений.Вставить(СтрокаВложений.Имя, СтрокаВложений.ДанныеФайла.Получить());
			КонецЦикла;
		Иначе
			ТОбъект = РеквизитФормыВЗначение("Объект");
			Для Каждого СтрокаВложений из ТОбъект.Вложения Цикл
				СтруктураВложений.Вставить(СтрокаВложений.Имя, СтрокаВложений.ДанныеФайла.Получить());
			КонецЦикла;
		КонецЕсли;
		
		ТелоHTML.УстановитьHTML(Объект.ТелоHTML, СтруктураВложений);
	КонецЕсли;
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСписокДоступныхОбъектов()
	
	мТипы = Метаданные.ОпределяемыеТипы.CW_ОбъектыШаблоновСтандартныхПисем.Тип.Типы();
	
	Для Каждого Тип из мТипы Цикл
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип);
		Элементы.ОбъектШаблона.СписокВыбора.Добавить(ИдентификаторОбъекта,,,БиблиотекаКартинок.Папка);
	КонецЦикла;
	
	Если Не Объект.ОбъектШаблона.Пустая() Тогда
		ТекущийТипОбъекта = ТипЗнч(Объект.ОбъектШаблона.ЗначениеПустойСсылки);
		Если мТипы.Найти(ТекущийТипОбъекта) = Неопределено Тогда
			ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТекущийТипОбъекта);
			Элементы.ОбъектШаблона.СписокВыбора.Добавить(ИдентификаторОбъекта,,,БиблиотекаКартинок.ВнешняяКомпонентаНеДоступна);
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ОбъектШаблона.Доступность = мТипы.Количество() > 1;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СтруктураВложений = Новый Структура;
	ТелоHTML.ПолучитьHTML(ТекущийОбъект.ТелоHTML, СтруктураВложений);
	
	ТекущийОбъект.Вложения.Очистить();
	Для Каждого ЭлементСтруктуры из СтруктураВложений Цикл
		НоваяСтрока = ТекущийОбъект.Вложения.Добавить();
		НоваяСтрока.Имя 		= ЭлементСтруктуры.Ключ;
		НоваяСтрока.ДанныеФайла = Новый ХранилищеЗначения(ЭлементСтруктуры.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоМакросов()
	
	ДеревоЗначений = Справочники.CW_ШаблоныСтандартныхПисем.ПолучитьСписокДоступныхМакросов(Объект.ОбъектШаблона);
	
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ДеревоМакросов");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьМакросы(Команда)
	
	ФлагПоказатьСкрытьМакросы = Не ФлагПоказатьСкрытьМакросы;
	ПоказатьСкрытьМакросыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСкрытьМакросыНаСервере()
	
	Элементы.ГруппаДоступныеМакросы.Видимость 	= ФлагПоказатьСкрытьМакросы;
	Элементы.ПоказатьСкрытьМакросы.Пометка 		= ФлагПоказатьСкрытьМакросы;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМакросовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ЭлементДерева = ДеревоМакросов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ЭлементДерева.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если НазначениеМакроса = 0 Тогда
		ДобавитьМакросВТело(ЭлементДерева.Значение);
	ИначеЕсли НазначениеМакроса = 1 Тогда 
		ДобавитьМакросВТему(ЭлементДерева.Значение);
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ДеревоМакросовНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение) 
	
	Выполнение = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьМакросВТело(Знач ИмяМакроса)
	
	Начало = 0; 
	Конец  = 0;        
	
	Элементы.ТелоHTML.ПолучитьГраницыВыделения(Начало, Конец);
	
	Если Начало <> Конец Тогда
		ТелоHTML.Удалить(Начало, Конец);	
	КонецЕсли;
	
	ТелоHTML.Вставить(Начало, ИмяМакроса);

КонецПроцедуры

&НаКлиенте
Процедура ТелоHTMLПриИзменении(Элемент)
	Модифицированность = истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМакросВТему(Знач ИмяМакроса) Экспорт
	
	НачалоСтроки = 0; 	КонецСтроки = 0;
	НачалоКолонки = 0;  КонецКолонки = 0;  
	
	Элементы.Тема.ПолучитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
	
	//Разделим тему по позиции курсора
	тмпТема 		= Объект.Тема;
	
	тмпТемаНачало 	= Лев(тмпТема,  НачалоКолонки-1);
	тмпТемаКонец  	= Сред(тмпТема, КонецКолонки);
	
	Объект.Тема = тмпТемаНачало + ИмяМакроса + тмпТемаКонец; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектШаблонаПриИзменении(Элемент)
	ЗаполнитьДеревоМакросов();                       
КонецПроцедуры



#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти
